rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "director" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", ""], ["release_date", "1968-04-05 00:00:00.000000"], ["updated_at", "2018-03-20 05:55:23.705661"], ["id", 7]]

  def show_directors
    @movie = Movie.find(params[:id])
    if @movie.director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]